1. Pandas store tabular data using a DataFrame.
2. A DataFrame is a two_dimensional labelled data structure like
   a table in databases.
3. Every DataFrame contains rows and colums, and therefore
   has both a row and colums index.
4. Each colum can have a different type of values.

In [47]:
import pandas as pd

In [4]:
std_data = [(1, "Hamza", 29 , "male" , "Faisalabad"),
           (2, "Majid", 32 , "male", "Lahore"),
           (3, "Saleem", 30, "male", "Bohawalpur"), 
           (4, "Altaf", 34, "male", "Mianwali"), 
           (5, "Sami", 36, "male", "Mianwali")]
df = pd.DataFrame(std_data,columns=["ID", "Name", "Age","Gander", "Address"])
print(df)

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
4   5    Sami   36   male    Mianwali

In [44]:
import csv
with open("std_data.csv","w" , newline= "") as file:
    csv_write = csv.writer(file, delimiter = ",")
    csv_write.writerow(["ID", "Name", "Age","Gander", "Address"])
    csv_write.writerow([1, "Hamza", 29 , "male" , "Faisalabad"])
    csv_write.writerow([2, "Majid", 32 , "male", "Lahore"])
    csv_write.writerow([3, "Saleem", 30, "male", "Bohawalpur"])
    csv_write.writerow([4, "Altaf", 34, "male", "Mianwali"])
    csv_write.writerow([5, "Sami", 36, "male", "Mianwali"])
    csv_write.writerow([6, "Wadood", 24, "male", "Kohat"])

In [77]:
dff = pd.read_csv("std_data.csv")
print(dff)

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
4   5    Sami   36   male    Mianwali
5   6  Wadood   24   male       Kohat

In [49]:
dff.head() # output first 5 row

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
4   5    Sami   36   male    Mianwali

In [50]:
dff.tail() # output last 5 row

   ID    Name  Age Gander     Address
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
4   5    Sami   36   male    Mianwali
5   6  Wadood   24   male       Kohat

In [51]:
s = f"Shape of csv file: {dff.shape} "
print(s)
s1 = f"Size of  csv file: {dff.size} "
print(s1)

Shape of csv file: (6, 5)
Size of  csv file: 30

In [52]:
dff.Age

0    29
1    32
2    30
3    34
4    36
5    24
Name: Age, dtype: int64

In [53]:
dff.Name

0     Hamza
1     Majid
2    Saleem
3     Altaf
4      Sami
5    Wadood
Name: Name, dtype: object

In [54]:
dff.Address

0    Faisalabad
1        Lahore
2    Bohawalpur
3      Mianwali
4      Mianwali
5         Kohat
Name: Address, dtype: object

In [55]:
dff.ID

0    1
1    2
2    3
3    4
4    5
5    6
Name: ID, dtype: int64

In [56]:
dff.Gander

0    male
1    male
2    male
3    male
4    male
5    male
Name: Gander, dtype: object

In [57]:
# Selecting rows and columns 
# Select a single columns
dff['Age']

0    29
1    32
2    30
3    34
4    36
5    24
Name: Age, dtype: int64

In [58]:
# Select multiple coloumns
dff[['Name','Address']]

     Name     Address
0   Hamza  Faisalabad
1   Majid      Lahore
2  Saleem  Bohawalpur
3   Altaf    Mianwali
4    Sami    Mianwali
5  Wadood       Kohat

In [59]:
# Select a single row by index label
dff.loc[0]

ID                  1
Name            Hamza
Age                29
Gander           male
Address    Faisalabad
Name: 0, dtype: object

In [60]:
# Select a multiple rows by index labels
dff.loc[[0,2,4]]

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
2   3  Saleem   30   male  Bohawalpur
4   5    Sami   36   male    Mianwali

In [61]:
# Select a single row by integer label
dff.iloc[0]

ID                  1
Name            Hamza
Age                29
Gander           male
Address    Faisalabad
Name: 0, dtype: object

In [62]:
# Select a multiple rows by integer label
dff.iloc[[0,2]]

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
2   3  Saleem   30   male  Bohawalpur

In [64]:
# Filtering row 
dff[dff['Age']> 30]

   ID   Name  Age Gander   Address
1   2  Majid   32   male    Lahore
3   4  Altaf   34   male  Mianwali
4   5   Sami   36   male  Mianwali

In [65]:
# Adding a New coloumn to a DataFrame 
dff['Phone No'] = [11,22,33,44,55,66]
dff

   ID    Name  Age Gander     Address  Phone No
0   1   Hamza   29   male  Faisalabad        11
1   2   Majid   32   male      Lahore        22
2   3  Saleem   30   male  Bohawalpur        33
3   4   Altaf   34   male    Mianwali        44
4   5    Sami   36   male    Mianwali        55
5   6  Wadood   24   male       Kohat        66

In [66]:
dff=dff.drop(columns=['Phone No'])
dff

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
4   5    Sami   36   male    Mianwali
5   6  Wadood   24   male       Kohat

In [78]:
dff.insert(3,'Phone No',[11,22,33,44,55,66])
print(dff)

   ID    Name  Age  Phone No Gander     Address
0   1   Hamza   29        11   male  Faisalabad
1   2   Majid   32        22   male      Lahore
2   3  Saleem   30        33   male  Bohawalpur
3   4   Altaf   34        44   male    Mianwali
4   5    Sami   36        55   male    Mianwali
5   6  Wadood   24        66   male       Kohat

In [79]:
dff.rename(columns= {'Age':'Stu_Age'})

   ID    Name  Stu_Age  Phone No Gander     Address
0   1   Hamza       29        11   male  Faisalabad
1   2   Majid       32        22   male      Lahore
2   3  Saleem       30        33   male  Bohawalpur
3   4   Altaf       34        44   male    Mianwali
4   5    Sami       36        55   male    Mianwali
5   6  Wadood       24        66   male       Kohat

In [82]:
# deleting a row from DataFrame
dff = dff.drop(4)
dff

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
5   6  Wadood   24   male       Kohat

In [85]:
# adding a new row in  existing DaraFrame 
dff.loc[4] = [7,"Zafar",31,"male", "Kohat"]
dff

   ID    Name  Age Gander     Address
0   1   Hamza   29   male  Faisalabad
1   2   Majid   32   male      Lahore
2   3  Saleem   30   male  Bohawalpur
3   4   Altaf   34   male    Mianwali
5   6  Wadood   24   male       Kohat
4   7   Zafar   31   male       Kohat

In [89]:
# updating the values 
dff.loc[2,"Age"]= 35
dff

   ID    Name  Age Gander     Address  stu_Age
0   1   Hamza   29   male  Faisalabad      NaN
1   2   Majid   32   male      Lahore      NaN
2   3  Saleem   35   male  Bohawalpur     33.0
3   4   Altaf   34   male    Mianwali      NaN
5   6  Wadood   24   male       Kohat      NaN
4   7   Zafar   31   male       Kohat      NaN

In [92]:
# updating the multiple values 
dff.loc[[0,1,2],'Name'] = 'Mian Hamza','Mian Majid' ,'Saleem'
dff

   ID        Name  Age Gander     Address  stu_Age
0   1  Mian Hamza   29   male  Faisalabad      NaN
1   2  Mian Majid   32   male      Lahore      NaN
2   3      Saleem   35   male  Bohawalpur     33.0
3   4       Altaf   34   male    Mianwali      NaN
5   6      Wadood   24   male       Kohat      NaN
4   7       Zafar   31   male       Kohat      NaN

In [95]:
import pandas as pd
df = pd.read_csv("C:/Users/haier/Downloads/weather_by_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [113]:
g = df.groupby("city")
g

In [104]:
for city,data in g:
    print("City", city)
    print("\n",data)

City mumbai

         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
City new york

         day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
City paris

          day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [105]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [107]:
g['temperature'].max()

city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64

In [111]:
g['windspeed'].mean()

city
mumbai       9.25
new york     8.00
paris       12.75
Name: windspeed, dtype: float64

In [110]:
g['windspeed'].mean()

In [114]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [115]:
import pandas as pd

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [116]:
import pandas as pd

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories, index = ["day1", "day2"])

print(myvar)

day1    420
day2    380
dtype: int64

In [119]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [125]:
df.loc['day1']

calories    420
duration     50
Name: day1, dtype: int64

In [129]:
df.loc[['day3','day1']]

      calories  duration
day3       390        45
day1       420        50

In [130]:
import pandas as pd

data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

df = pd.DataFrame(data)

print(df)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [131]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       6 non-null      int64
 1   Name     6 non-null      object
 2   Age      6 non-null      int64
 3   Gander   6 non-null      object
 4   Address  6 non-null      object
 5   stu_Age  1 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 508.0+ bytes